{
  "language": "es",
  "header": {
    "projects": "proyectos",
    "aboutme": "sobre mí",
    "contact": "contacto"
  },
  "home": {
    "a1": "Hola, soy Jeffer Steven, un",
    "a2": "desarrollador web",
    "a3": "centrado en el",
    "a4": "frontend",
    "a5": ". Me apasiona crear",
    "a6": "sitios web",
    "a7": "interactivos y",
    "a8": "aplicaciones",
    "a9": "que brinden experiencias de usuario excepcionales."
  },
  "projects": {
    "title": "Proyectos",
    "projects": [
      {
        "id": 1,
        "title": "tools match",
        "image": "/images/tools-match-app.png",
        "content": "ToolMatch es una aplicación web desarrollada como proyecto final grupal durante el bootcamp Full Stack Developer de Henry. La aplicación utiliza metodología Scrum y GitHub Flow. Está diseñada para facilitar la compra, venta y alquiler de herramientas usadas en comunidades de barrios latinoamericanos. ToolMatch utiliza tecnologías como Prisma, Next.js, Tailwind CSS y PostgreSQL. Además, cuenta con características adicionales como autenticación con Google, pasarelas de pagos con Mercado Pago y notificaciones con Nodemailer. Con todas estas funcionalidades, ToolMatch proporciona una plataforma segura, conveniente y completa para intercambiar herramientas entre vecinos de barrios latinoamericanos.",
        "technologies": ["prisma", "nextjs", "tailwind", "postgresql", "css"],
        "github": "https://github.com/Jefersonsteven/tools-match",
        "web": "https://tools-match-eight.vercel.app"
      },
      {
        "id": 2,
        "title": "pokemon app",
        "image": "/images/pokemon-app.png",
        "content": "Este aplicación web basada en React funciona como una Pokédex, permitiendo a los usuarios buscar, filtrar y ver detalles de los Pokémon. Utiliza la API de Pokémon para mostrar información existente y permite la creación de nuevos Pokémon en una base de datos PostgreSQL. Además, ofrece funciones de clasificación por orden alfabético, ataque y creación, y la posibilidad de ver detalles detallados de cada Pokémon, como tipo, habilidades, estadísticas y movimientos. En resumen, brinda una experiencia completa de Pokédex para los fans de Pokémon.",
        "technologies": [
          "redux",
          "react",
          "sass",
          "postgresql",
          "express",
          "sequelize",
          "api"
        ],
        "github": "https://github.com/Jefersonsteven/pokemon-app",
        "web": "https://pokemon-app-pokedex-jeffer.netlify.app"
      },
      {
        "id": 3,
        "title": "entertainment web app",
        "image": "/images/entertainment-web-app.png",
        "content": "Este proyecto es un desafío de frontend llamado 'Aplicación web de entretenimiento' de Frontend Mentor. El objetivo es crear una aplicación web que se asemeje lo más posible al diseño proporcionado utilizando React y Sass. Los usuarios deberían poder navegar entre diferentes páginas, agregar/eliminar favoritos y buscar programas. La aplicación debe ser receptiva y mostrar estados de hover para los elementos interactivos. En este caso, la aplicación está diseñada para ver películas y series.",
        "technologies": ["react", "redux", "sass"],
        "github": "https://github.com/Jefersonsteven/entertainment-web-app",
        "web": "https://entertainment-web-app-jeffer-24c083.netlify.app/"
      }
    ]
  },
  "challenges": {
    "title": "Mas proyectos",
    "challenges": [
      {
        "id": 1,
        "title": "calculator app",
        "image": "/images/calculator-app.png",
        "technologies": ["html", "sass", "typescript"],
        "github": "https://github.com/Jefersonsteven/calculator-typescript-app",
        "web": "https://calculator-ts-jeffer.netlify.app/"
      },
      {
        "id": 2,
        "title": "advice generator app",
        "image": "/images/advice-generator-app.png",
        "technologies": ["html", "css", "javascript", "api"],
        "github": "https://github.com/Jefersonsteven/Advice-Generator-App",
        "web": "https://advice-generator-app-jeffer.netlify.app/"
      }
    ]
  },
  "aboutme": {
    "title": "sobre mi",
    "photo": "/images/Me.png",
    "content": "Hola, soy Jeffer Steven, un desarrollador web centrado en el frontend, con experiencia en diseño y desarrollo de software. Mis herramientas tecnológicas incluyen ReactJs, NextJs, Redux, JavaScript, TypeScript, Html, Css, Sass, Tailwind, Postgresql, Sequelize, express y nodejs. Además, tengo habilidades en herramientas de diseño como Figma, Adobe Illustrator y Adobe Photoshop. He completado varios proyectos en mi tiempo libre, algunos de los cuales están disponibles en mi portafolio. Estoy buscando activamente oportunidades emocionantes y desafiantes para seguir creciendo como desarrollador web.",
    "button": "Más",
    "cv": "/CV.pdf"
  },
  "contact": {
    "title": "contacto",
    "name": "nombre",
    "mail": "correo",
    "subject": "asunto",
    "message": "mensaje",
    "button": "enviar"
  }
}
